RedditClone/app/controllers/posts_controller.rb

    def new
      @post = Post.new
      @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def create
      #what makes a post is a title, url, content, user_id, sub_id
      @post = Post.new(post_params)
      @post.user_id = current_user.id
      if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "wewweew"], ["url", "wewewew"], ["content", "ewewewewwe"], ["user_id", 1], ["created_at", "2019-07-09 21:28:56.740946"], ["updated_at", "2019-07-09 21:28:56.740946"]]