RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("user_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "redditclone"], ["description", "fwwefwefw"], ["created_at", "2019-07-09 19:43:07.932576"], ["updated_at", "2019-07-09 19:43:07.932576"]]
---
  def create
    #creating a new instance of sub
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = ? AND "subs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["title", "ilovethis"], ["description", "this is amazing"], ["updated_at", "2019-07-09 20:11:24.036711"], ["id", 3]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)