RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "BTkseZ8tMuoBIeUnRw37FQ"], ["updated_at", "2019-07-09 19:22:14.612826"], ["id", 1]]
---
  def reset_session_token
    self.update!(session_token: User.generate_session_token)